{
  "backend/main.mo": "Main Motoko actor defining types (Student, Teacher, Exam, Message, Artwork, AdmissionForm) and implementing student/teacher management, admission workflows, messaging, artwork gallery, and analytics with role-based access control and blob storage.",
  "feature_evidence.json": "JSON report mapping implemented features (homepage, admission pages, gallery, WhatsApp button, forms, login, dashboards) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Pre-generated summaries of all frontend TypeScript/React files describing routing, layouts, authentication, pages, hooks, and components for the art academy application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and root div mounting point.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with all application routes (public pages, student/teacher dashboards) wrapped in ThemeProvider with toast notifications.",
  "frontend/src/components/analytics/StatsCard.tsx": "Reusable card component displaying a statistic with title, numeric value, icon, and gradient color background.",
  "frontend/src/components/analytics/StudentLevelChart.tsx": "Bar chart component using Recharts to visualize student distribution across exam levels with colorful bars and rotated labels.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Full-screen error page with shield icon and message shown when users lack permission to access a route, includes link back to homepage.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button component handling Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name and save it. Prevents closing until profile is created.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Route wrapper that checks authentication and optionally admin role, showing loading states or access denied screens as needed.",
  "frontend/src/components/common/WhatsAppButton.tsx": "Fixed floating button in bottom-right corner that opens WhatsApp chat with pre-filled message about the art academy.",
  "frontend/src/components/forms/ArtworkUpload.tsx": "File upload component with preview, progress tracking, and conversion of selected image files to ExternalBlob format for backend upload.",
  "frontend/src/components/gallery/ArtworkCard.tsx": "Card component displaying artwork image, title, and level badge with hover effects and gradient styling.",
  "frontend/src/components/layout/Footer.tsx": "Footer with academy info, contact details, social media links, and attribution to caffeine.ai with dynamic year and hostname.",
  "frontend/src/components/layout/Header.tsx": "Navigation header with logo, menu links (Home, Admissions, Gallery, Dashboard), login button, user greeting, and responsive mobile menu.",
  "frontend/src/components/layout/Layout.tsx": "Root layout component wrapping Header, main content outlet, Footer, WhatsApp button, and profile setup modal with gradient background.",
  "frontend/src/components/student/HomeworkPanel.tsx": "Empty state component showing a message that no homework assignments are currently available.",
  "frontend/src/components/student/LiveClassEmbed.tsx": "Empty state component indicating no live class is currently active with video icon and instructional message.",
  "frontend/src/components/student/MessagesPanel.tsx": "Displays list of messages with content and date, or shows empty state if no messages exist.",
  "frontend/src/components/teacher/ArtworkUploadForm.tsx": "Form for teachers to upload student artwork with fields for title, student selection, level, public visibility toggle, and image upload with validation.",
  "frontend/src/components/teacher/MessageComposer.tsx": "A form component that allows teachers to compose and send messages to all students, with a textarea input and submit button that shows loading state during message sending.",
  "frontend/src/components/teacher/PromoteStudentModal.tsx": "A modal dialog component for promoting a student to a new exam level, displaying current level and providing a dropdown to select from available exam levels (Adhya, Madhya, Purna, Year1-8).",
  "frontend/src/components/teacher/StudentCard.tsx": "A card component displaying student information including name, level, guardian, exam count, and a promote button that opens the PromoteStudentModal.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that manages the backend actor instance, creating it with authentication identity and initializing access control, while invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for managing user login/logout state, identity delegation, and auth client lifecycle with configurable options.",
  "frontend/src/hooks/usePromoteStudent.ts": "A mutation hook that calls the backend actor to promote a student to a new exam level and invalidates student-related queries on success.",
  "frontend/src/hooks/usePublicGallery.ts": "A query hook that fetches public artworks from the backend actor for display in the public gallery.",
  "frontend/src/hooks/useQueries.ts": "An intentionally empty file serving as a placeholder, as queries are organized in separate hook files.",
  "frontend/src/hooks/useSearchStudents.ts": "A query hook that searches for students by name using the backend actor, with the search term as a query key parameter.",
  "frontend/src/hooks/useSendMessage.ts": "A mutation hook that sends a message through the backend actor and invalidates student queries on success.",
  "frontend/src/hooks/useStudentData.ts": "A query hook that fetches a single student's data by ID from the backend actor.",
  "frontend/src/hooks/useSubmitAdmission.ts": "A mutation hook for submitting admission forms with student name, guardian name, exam level, and artwork blob to the backend.",
  "frontend/src/hooks/useUploadArtwork.ts": "A mutation hook for uploading artwork with title, artist ID, level, visibility flag, and image blob, invalidating public artworks query on success.",
  "frontend/src/hooks/useUserProfile.ts": "Provides query and mutation hooks for fetching and saving the current user's profile data through the backend actor.",
  "frontend/src/hooks/useUserRole.ts": "A query hook that fetches the current user's role from the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a vibrant, child-friendly color scheme for light and dark modes, including primary (orange), secondary (pink), accent (purple), and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdmissionFormPage.tsx": "Admission application form page that collects student/guardian info, exam level, and artwork upload; shows success confirmation with application ID after submission.",
  "frontend/src/pages/AdmissionInfoPage.tsx": "Public informational page explaining the admission process (4 steps), exam level system (11 levels from Adhya to 8th Year), and requirements for applying.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature cards highlighting academy benefits (expert teachers, small classes, certified programs), and call-to-action buttons for applying and viewing gallery.",
  "frontend/src/pages/PublicGalleryPage.tsx": "Public gallery page displaying student artworks in a grid layout with loading and empty states.",
  "frontend/src/pages/StudentDashboard.tsx": "Protected student dashboard showing profile info, current level badge, and panels for messages, homework, and live class embed.",
  "frontend/src/pages/TeacherAdmissionsPage.tsx": "Protected teacher page for reviewing pending admission applications (placeholder UI indicating functionality coming soon).",
  "frontend/src/pages/TeacherAnalyticsPage.tsx": "Protected teacher analytics dashboard displaying student statistics, level distribution, and charts for enrollment insights.",
  "frontend/src/pages/TeacherDashboard.tsx": "Teacher dashboard landing page with a grid of navigation cards linking to student management, admissions, messages, resources, live streaming, gallery, and analytics sections. Protected by admin-only route guard.",
  "frontend/src/pages/TeacherGalleryManagementPage.tsx": "Teacher page for uploading and managing student artwork to the public gallery. Contains the ArtworkUploadForm component within a protected admin route.",
  "frontend/src/pages/TeacherLiveStreamPage.tsx": "Placeholder page for future live streaming functionality where teachers will broadcast art classes. Currently shows a coming-soon message within a protected route.",
  "frontend/src/pages/TeacherMessagesPage.tsx": "Teacher page for composing and sending messages/homework to students. Contains the MessageComposer component within a protected admin route.",
  "frontend/src/pages/TeacherResourcesPage.tsx": "Placeholder page for future teaching resource uploads (reference paintings, demos, guides). Currently shows a coming-soon message within a protected route.",
  "frontend/src/pages/TeacherStudentManagementPage.tsx": "Teacher page displaying all enrolled students with search functionality. Uses useSearchStudents hook and renders StudentCard components for each student within a protected admin route.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support. Includes functions to clear sensitive parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended border radius, shadows, animations, and typography/container plugins for the art academy UI design system.",
  "project_state.json": "Project metadata defining the digital art academy platform architecture with multi-role system, MongoDB backend, 13-level exam progression, live streaming, and mobile-first design. Lists completed features and required image assets."
}